# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv10 object detection model. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  m: [0.67, 0.75, 768]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2

  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]] # 2-loc1

  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4-loc2

  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6-loc3

  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True]]

  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10


n_first_layers: 11

b1_save: [0, 2, 4, 6, 10]
b2_save: [12, 14, 19]

keep_input: True

dual_backbone:
  - [0, 1, CBLinear, [[64]]] # 0                        # From P1/2 block 0: last layer index, 64: start/end width
  - [2, 1, CBLinear, [[64, 128]]] # 1                   #      P2/4       2                    128
  - [4, 1, CBLinear, [[64, 128, 256]]] # 2              #      P3/8       4                    256
  - [6, 1, CBLinear, [[64, 128, 256, 512]]] # 3         #      P4/16      6                    512
  - [10, 1, CBLinear, [[64, 128, 256, 512, 1024]]] # 4. #      P5/32      10                   1024

  - [input, 1, Conv, [64, 3, 2]] # 5-P1/2
  - [[-6, -5, -4, -3, -2, -1], 1, CBFuse, [[0, 0, 0, 0, 0]]] # 6

  - [-1, 1, Conv, [128, 3, 2]] # 7-P2/4
  - [[-7, -6, -5, -4, -1], 1, CBFuse, [[1, 1, 1, 1]]] # 8
  - [-1, 3, C2f, [128, True]] # 9-loc1

  - [-1, 1, Conv, [256, 3, 2]] # 10-P3/8
  - [[-9, -8, -7, -1], 1, CBFuse, [[2, 2, 2]]] # 11
  - [-1, 6, C2f, [256, True]] # 12-loc2

  - [-1, 1, SCDown, [512, 3, 2]] # 12-P4/16
  - [[-11, -10, -1], 1, CBFuse, [[3, 3]]] # 13
  - [-1, 6, C2f, [512, True]] # 14-loc3

  - [-1, 1, SCDown, [1024, 3, 2]] # 15-P5/32
  - [[-13, -1], 1, CBFuse, [[4]]] # 16
  - [-1, 3, C2fCIB, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] #18
  - [-1, 1, PSA, [1024]] # 19-loc4

# YOLOv10.0n head
head:
  - [10, 1, nn.Upsample, [None, 2, "nearest"]] # 0
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 2

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 5 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, -6], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fCIB, [512, True]] # 8 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True]] # 11 (P5/32-large)

  - [[-7, -4, -1], 1, v10Detect, [nc]] # Detect(P3, P4, P5)

head2:
  - [19, 1, nn.Upsample, [None, 2, "nearest"]] # 0
  - [[-1, 14], 1, Concat, [1]] # cat dual_backbone P4
  - [-1, 3, C2f, [512]] # 2

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 12], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 5 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, -6], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2fCIB, [512, True]] # 8 (P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]
  - [[-1, 19], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2fCIB, [1024, True]] # 11 (P5/32-large)

  - [[-7, -4, -1], 1, v10Detect, [nc]] # Detect(P3, P4, P5)
